#include "App/app.h"
#include "App/test.h" /* ضفنا مكتبة التست */

int main(void)
{
    /* ================================================= */
    /*                 وضع الاختبار (Testing)            */
    /* ================================================= */
    
    //Test_LCD(); 
    //Test_Ultrasonic();
    //Test_Temperature();
    //Test_Windows();
    //Test_UART0();
    /* ================================================= */
    /*           كود المشروع الأساسي (اعمله Comment)     */
    /* ================================================= */
    /*
    /* 1. تهيئة النظام */
    App_Init();

    /* 2. تشغيل الحلقة الرئيسية للمشروع */
    App_Run();

    return 0;
}